IDENTIFICATION DIVISION.
PROGRAM-ID. ADD-TWO-NUMBERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
  01 NUM1 PIC 9(9) VALUE 123.
  01 NUM2 PIC 9(9) VALUE 456.
  01 SUM PIC 9(9).

PROCEDURE DIVISION.
  COMPUTE SUM = NUM1 + NUM2.
  DISPLAY "The sum is: " SUM.

STOP RUN.